grevaillot/svd_tools/headers/STM32L0x2/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define USART2_BASE			(0x40004400)
#define LPUSART1_BASE			(0x40004800)
#define USART4_BASE			(0x40004c00)
#define USART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define USB_FS_BASE			(0x40005c00)
#define USB_SRAM_BASE			(0x40006000)
#define CRS_BASE			(0x40006c00)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define I2C3_BASE			(0x40007800)
#define LPTIM_BASE			(0x40007c00)
#define SYSCFG_COMP_BASE			(0x40010000)
#define EXTI_BASE			(0x40010400)
#define TIM21_BASE			(0x40010800)
#define TIM22_BASE			(0x40011400)
#define Firewall_BASE			(0x40011c00)
#define ADC_BASE			(0x40012400)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define DBGMCU_BASE			(0x40015800)
#define DMA1_BASE			(0x40020000)
#define RCC_BASE			(0x40021000)
#define Flash_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define TSC_BASE			(0x40024000)
#define RNG_BASE			(0x40025000)
#define AES_BASE			(0x40026000)
#define GPIOA_BASE			(0x50000000)
#define GPIOB_BASE			(0x50000400)
#define GPIOC_BASE			(0x50000800)
#define GPIOD_BASE			(0x50000c00)
#define GPIOE_BASE			(0x50001000)
#define GPIOH_BASE			(0x50001c00)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define MPU_BASE			(0xe000ed90)
